constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          180;
        startFace       225990;
    }
    outlet
    {
        type            patch;
        nFaces          180;
        startFace       226170;
    }
    wall_upper
    {
        type            wall;
        inGroups        1(wall);
        nFaces          630;
        startFace       226350;
    }
    wall_lower
    {
        type            wall;
        inGroups        1(wall);
        nFaces          630;
        startFace       226980;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          226800;
        startFace       227610;
    }
)

// ************************************************************************* //
